cask_args appdir: '/Applications'

# TODO(zq7): split all apps here into different files.
tap 'homebrew/bundle'

brew 'git'
brew 'ack'
brew 'coreutils'
brew 'ripgrep'
brew 'cmake'
brew 'llvm', args: ['--with-toolchain']
brew 'rg'
brew 'go'
brew 'gdb'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'trash-cli'
brew 'openssl'
brew 'ffmpeg'
brew 'redsocks'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'tmux'
brew 'htop'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'sshfs'
brew 'python3'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'neovim'
brew 'autojump'
brew 'proxychains-ng'
brew 'tree'
brew 'lsyncd'
brew 'fswatch'

cask 'google-chrome'
cask 'handbrake'
cask 'transmission'
cask 'osxfuse'
cask 'pdfexpert'
cask 'obs'
cask 'iina'
cask 'karabiner-elements'
cask 'visual-studio-code'
cask 'xquartz'
# cask 'graphviz', args: ['--with-gts']
cask 'alfred'
cask 'sepctacle'
cask 'snipaste'
cask 'neteasemusic'
cask 'wechat'
cask 'flux'
cask 'docker'
cask 'docker-toolbox'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'squirrel'
cask 'sublime-text'
cask 'veracrypt'
cask 'launchcontrol'
cask 'gimp'
cask 'thunderbird'
cask 'adobe-photoshop-cs6'
cask 'evernote'
cask 'mactex'
cask 'slack'
